const 清肺排毒汤 = Object.freeze({
  "麻黄": 9,
  "炙甘草": 6,
  "杏仁": 9,
  "生石膏(先煎〉": [15, 30],
  "桂枝": 9,
  "泽泻": 9,
  "猪苓": 9,
  "白术": 9,
  "获苓": 15,
  "柴胡": 16,
  "黄苓": 6,
  "姜半夏": 9,
  "生姜": 9,
  "紫苑": 9,
  "冬花": 9,
  "射干": 9,
  "细辛": 6,
  "山药": 12,
  "枳实": 6,
  "陈皮": 6,
  "藿香": 9
})

const 寒湿郁肺证 = Object.freeze({
  "生麻黄": 6,
  "生石膏": 15,
  "杏仁": 9,
  "羌活": 15,
  "葶苈子": 15,
  "贯众": 9,
  "地龙": 15,
  "徐长卿": 15,
  "藿香": 15,
  "佩兰": 9,
  "苍术": 15,
  "云苓": 45,
  "生白术": 30,
  "焦三仙（各）": 9,
  "厚朴": 15,
  "焦槟榔": 9,
  "煨草果": 9,
  "生姜": 15
})

const 湿热蕴肺证 = Object.freeze({
  "槟榔": 10,
  "草果": 10,
  "厚朴": 10,
  "知母": 10,
  "黄苓": 10,
  "柴胡": 10,
  "赤芍": 10,
  "连翘": 15,
  "青蒿(后下)": 10,
  "苍术": 10,
  "大青叶": 10,
  "生甘草": 5
})